# TfDashM Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..TfDashM Property
SymbolTypeId Class See Also
---
Symbol Tf-m, indicating unit Tonne force meters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId TfDashM { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TfDashM As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TfDashM {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace